{
  "config": {
    "max_co2": 100,
    "max_water": 100,
    "min_innovation": 0
  },
  "intro": {
    "title": "Bienvenue chez GreenGen",
    "text": "Vous êtes le nouvel Auditeur Junior. Votre mission : aider la CEO à intégrer l'IA sans détruire la planète. Attention à vos jauges : l'Innovation doit monter, mais le CO2 et l'Eau doivent rester sous contrôle.",
    "button": "Commencer l'audit"
  },
  "scenarios": [
    {
      "id": 1,
      "title": "Le Résumé Automatique",
      "ceo_request": "Nos utilisateurs ont la flemme de lire. Je veux une IA qui résume leurs notes automatiquement. On lance ça ?",
      "image": "assets/data/inference.png",
      "theory": {
        "concept": "Inférence vs Entraînement",
        "definition": "L'inférence est le coût énergétique de l'utilisation du modèle, pas de sa création.",
        "analogie": "L'entraînement, c'est construire l'autoroute (coût unique élevé). L'inférence, c'est chaque voiture qui roule dessus (coût faible, mais multiplié par des millions).",
        "so_what": "Pour une fonction simple utilisée par tous, l'inférence cumulée peut dépasser le coût d'entraînement."
      },
      "choices": [
        {
          "text": "Utiliser un LLM géant (GPT-4) pour tout résumer.",
          "feedback": "C'est comme prendre un avion de chasse pour aller acheter du pain. Trop énergivore pour un simple résumé.",
          "impact": { "innovation": 20, "co2": 40, "water": 10 }
        },
        {
          "text": "Utiliser un petit modèle spécialisé (SLM) optimisé.",
          "feedback": "Excellent choix. Le modèle est moins 'intelligent' mais suffit largement pour résumer, et consomme 50x moins.",
          "impact": { "innovation": 15, "co2": 5, "water": 2 }
        }
      ]
    },
    {
      "id": 2,
      "title": "La Génération d'Images",
      "ceo_request": "Je veux que les utilisateurs puissent générer des couvertures de dossiers en 4K avec des dragons !",
      "image": "assets/data/gpu_heat.png",
      "theory": {
        "concept": "Coût Matériel & Eau",
        "definition": "La génération d'images demande un calcul intensif (GPU) qui surchauffe les serveurs.",
        "analogie": "C'est l'équivalent de faire tourner un four à pyrolyse pour chaque image. Il faut refroidir ce four avec de l'eau.",
        "so_what": "Une image générée = une charge complète de smartphone. Est-ce utile pour décorer un dossier ?"
      },
      "choices": [
        {
          "text": "Validé ! C'est trop cool.",
          "feedback": "L'impact est désastreux. L'eau potable utilisée pour refroidir les serveurs manque aux populations locales.",
          "impact": { "innovation": 25, "co2": 30, "water": 50 }
        },
        {
          "text": "Refusé. Proposons une banque d'images vectorielles légères.",
          "feedback": "Choix sobre. Moins 'wow', mais infiniment plus durable.",
          "impact": { "innovation": -5, "co2": 0, "water": 0 }
        }
      ]
    },
    {
      "id": 3,
      "title": "Le Chatbot H24",
      "ceo_request": "Remplaçons le SAV par une IA qui répond instantanément, tout le temps.",
      "image": "assets/data/datacenter.png",
      "theory": {
        "concept": "L'Effet Rebond (Paradoxe de Jevons)",
        "definition": "Plus une technologie est efficace et accessible, plus on l'utilise, annulant les gains d'efficacité.",
        "analogie": "Depuis que les moteurs consomment moins, on roule plus et on achète des voitures plus grosses.",
        "so_what": "Un chatbot efficace risque d'augmenter le nombre de requêtes inutiles."
      },
      "choices": [
        {
          "text": "OK, mais on héberge ça en Norvège (Hydroélectricité).",
          "feedback": "Bon réflexe ! L'emplacement du serveur change tout au bilan carbone (mix énergétique décarboné).",
          "impact": { "innovation": 15, "co2": 5, "water": 10 }
        },
        {
          "text": "OK, hébergement standard (USA/Virginie).",
          "feedback": "Mauvaise idée. La Virginie fonctionne encore beaucoup au charbon/gaz.",
          "impact": { "innovation": 15, "co2": 35, "water": 20 }
        }
      ]
    },
    {
      "id": 4,
      "title": "Le Renouvellement Matériel",
      "ceo_request": "Nos serveurs ont 3 ans. Ils fonctionnent encore, mais les nouveaux sont 15% plus rapides. On change tout ?",
      "image": "assets/data/hardware.png",
      "theory": {
        "concept": "Dette Grise (Fabrication)",
        "definition": "La majorité de l'empreinte carbone d'un appareil numérique provient de sa fabrication, pas de son utilisation électrique.",
        "analogie": "C'est le 'sac à dos écologique' : un ordinateur de 2kg a nécessité le déplacement de 800kg de matière pour être créé.",
        "so_what": "Changer de matériel trop souvent annule tous les efforts d'optimisation logicielle."
      },
      "choices": [
        {
          "text": "On change ! Il faut de la puissance.",
          "feedback": "Erreur critique. Jeter du matériel fonctionnel est le pire geste écologique possible.",
          "impact": { "innovation": 20, "co2": 40, "water": 30 }
        },
        {
          "text": "On garde le matériel 2 ans de plus.",
          "feedback": "Sage décision. Allonger la durée de vie divise l'impact carbone annuel par deux.",
          "impact": { "innovation": 5, "co2": 0, "water": 0 }
        }
      ]
    },
    {
      "id": 5,
      "title": "Le Stockage des Données",
      "ceo_request": "On a des millions de vieux logs utilisateurs d'il y a 5 ans. On garde tout 'au cas où' on voudrait réentraîner une IA ?",
      "image": "assets/data/storage.png",
      "theory": {
        "concept": "Dark Data",
        "definition": "Les données stockées inutilement consomment de l'espace disque et de l'électricité 24h/24.",
        "analogie": "C'est comme laisser le chauffage allumé à fond dans une maison de vacances vide toute l'année.",
        "so_what": "Le nettoyage des données (Data Hygiene) est un levier d'action immédiat et gratuit."
      },
      "choices": [
        {
          "text": "Gardons tout (Data Hoarding).",
          "feedback": "Mauvaise pratique. Ces données 'zombies' polluent pour rien.",
          "impact": { "innovation": 5, "co2": 15, "water": 5 }
        },
        {
          "text": "Supprimons les données > 2 ans.",
          "feedback": "Parfait. Moins de stockage = moins de disques durs à fabriquer et alimenter.",
          "impact": { "innovation": 0, "co2": -5, "water": 0 }
        }
      ]
    },
    {
      "id": 6,
      "title": "L'Optimisation du Code",
      "ceo_request": "Les développeurs veulent coder vite en Python sans optimiser. Le temps c'est de l'argent, non ?",
      "image": "assets/data/code.png",
      "theory": {
        "concept": "Green Coding",
        "definition": "Un code mal optimisé oblige le processeur à travailler plus longtemps pour le même résultat.",
        "analogie": "C'est comme conduire une voiture avec le frein à main serré. Vous avancez, mais vous brûlez beaucoup plus d'essence.",
        "so_what": "Sur une application mobile, un code lourd vide la batterie de l'utilisateur (impact déporté)."
      },
      "choices": [
        {
          "text": "Laissez-les coder vite, on s'en fiche.",
          "feedback": "Vision à court terme. L'appli sera lente et énergivore sur des millions de téléphones.",
          "impact": { "innovation": 10, "co2": 25, "water": 5 }
        },
        {
          "text": "Exigez une optimisation stricte.",
          "feedback": "Bravo. Le code propre est la forme la plus pure d'écologie numérique.",
          "impact": { "innovation": 5, "co2": -5, "water": 0 }
        }
      ]
    },
    {
      "id": 7,
      "title": "Réinventer la Roue ?",
      "ceo_request": "Pour notre système de reconnaissance vocale, on entraîne notre propre modèle de A à Z ou on adapte un existant ?",
      "image": "assets/data/training.png",
      "theory": {
        "concept": "Transfer Learning (Fine-tuning)",
        "definition": "Réutiliser un modèle pré-entraîné et l'ajuster coûte infiniment moins cher que de partir de zéro.",
        "analogie": "Voulez-vous apprendre à un enfant à lire (Entraînement complet) ou apprendre à un adulte un nouveau vocabulaire (Fine-tuning) ?",
        "so_what": "L'entraînement complet est réservé aux géants de la Tech. Ne gaspillez pas de GPU pour ça."
      },
      "choices": [
        {
          "text": "On entraîne tout de zéro (From Scratch).",
          "feedback": "Gaspillage massif. Vous brûlez des mois de calcul GPU pour un résultat incertain.",
          "impact": { "innovation": 20, "co2": 50, "water": 20 }
        },
        {
          "text": "On adapte un modèle Open Source (Whisper).",
          "feedback": "Excellent. C'est l'approche la plus efficiente et rapide.",
          "impact": { "innovation": 15, "co2": 10, "water": 5 }
        }
      ]
    },
    {
      "id": 8,
      "title": "IA pour tout ?",
      "ceo_request": "Ajoutons une IA pour trier la liste des contacts par ordre alphabétique. Ça fait moderne !",
      "image": "assets/data/code.png",
      "theory": {
        "concept": "Sobriété Fonctionnelle",
        "definition": "Utiliser l'IA pour des tâches algorithmiques simples est une aberration énergétique.",
        "analogie": "C'est utiliser un marteau-piqueur pour casser une noix. Un simple casse-noix (code classique) suffit.",
        "so_what": "Le discernement technologique est la compétence clé du Green IT."
      },
      "choices": [
        {
          "text": "Oui, mettons de l'IA partout !",
          "feedback": "Ridicule. Une fonction de tri classique consomme 0.0001 Wh. L'IA en consomme 1000 fois plus.",
          "impact": { "innovation": 5, "co2": 15, "water": 5 }
        },
        {
          "text": "Non, un algo classique suffit.",
          "feedback": "C'est ça, l'ingénierie responsable. Le bon outil pour le bon usage.",
          "impact": { "innovation": 0, "co2": 0, "water": 0 }
        }
      ]
    }
  ],
  "conclusion": {
    "success": "Mission Accomplie ! Vous avez trouvé l'équilibre entre progrès et sobriété.",
    "failure": "Échec critique. Votre application est innovante, mais l'environnement est saccagé.",
    "restart": "Recommencer l'audit"
  }
}